trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D_MULES/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5; //3; //35;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5; //1;

maxDi           0.25;

maxDeltaT       0.01;

libs
(
    "libfvPatchFieldsPyrolysis.so"
);

functions
(
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        //outputInterval  10;
        outputInterval  1;
        probeLocations
        (
            ( 0.0001 0.1 0.225 )
        );
        fields
        (
            T
        );
    }

    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        //outputInterval  10;
        outputInterval  1;
        region        panelRegion;
        probeLocations
        (
            ( -0.0001 0.1 0.225 )
        );
        fields
        (
            T
        );
    }

    patchProbes
    {
        type            patchProbes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  1;
        region        panelRegion;
        patchName      region0_to_panelRegion_panel;
        probeLocations
        (
            ( 0 0.1 0.225 )
            ( 0 0.1 0.325 )
            ( 0 0.1 0.425 )
            ( 0 0.1 0.525 )
            //( 0 0.1 0.475 )
            //( 0 0.1 0.575 )
        );
        fields
        (
            T
            emissivity
        );
    }

    patchProbes
    {
        type            patchProbes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  1;
        patchName      region0_to_panelRegion_panel;
        probeLocations
        (
            ( 0 0.1 0.225 )
            ( 0 0.1 0.325 )
            ( 0 0.1 0.425 )
            ( 0 0.1 0.525 )
        );
        fields
        (
            T
            Qr
        );
    }

    HRR
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  //outputTime;
        outputInterval  1;
        log             false;     
        valueOutput     false;
        source          all;       //cellZone;
        sourceName      c0;
        operation       volIntegrate;
        fields
        (
            dQ
        );
    }

    patchBurner 
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep; 
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      burner;
        operation       sum;
        fields
        (
            phi
            HRR_fu
        );
    }

    patchPanel 
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      region0_to_panelRegion_panel;
        operation       sum;
        fields
        (
            phi
            HRR_fu
        );
    }

    patchOutlet 
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep; 
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      outlet;
        operation       sum;
        fields
        (
            phi
            HRR_fu
        );
    }

    patchPanelSolidRegion 
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        region          panelRegion;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      region0_to_panelRegion_panel;
        operation       sum;
        fields
        (
            phiGas
        );
    }

    patchPanelQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      region0_to_panelRegion_panel;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

    patchWallQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      wall;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

    patchSideQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      side;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

    patchBurnerQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      burner;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

    patchOutletQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      outlet;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

    patchGroundQr
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;  
        outputInterval  1;
        log             false;
        valueOutput     false;
        source          patch;
        sourceName      ground;
        operation       areaIntegrate;
        fields
        (
            Qr
        );
    }

);

// ************************************************************************* //
