trunk/fireFoam/testBatteryFireFOAM/wallFireSpread2D_MULES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    };

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-5;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        //nCellsInCoarsestLevel   1;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    p_rghFinal
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 10;
        //nCellsInCoarsestLevel 1;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    Yi
    {
        //solver          PBiCG;
        //preconditioner  DILU;
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    };

/*
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        nSweeps         1;
    };

    UFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        nSweeps         1;
    };

    Yi
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        nSweeps         1;
    };

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        nSweeps         1;
    };
*/

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.0;
    };

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
    };

    k 
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    };

    hs
    {
        solver          PCG;
        preconditioner  DIC;
        //solver          PBiCG;
        //preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    };

    Ii
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0;
        smoother            DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

}

MULES
{
    bMULES     yes;
    bHsMULES   yes;
}


PISO
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    U       0.9;
    "CH4|C3H8|CORRUGATED|CH2O|O2|H2O|CO2"  0.9;       
    hs       0.9;
    k        0.9;
}


// ************************************************************************* //
